zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/startup_MCXE31B.c
#if !defined(BYPASS_ECC_SRAM_INIT)
    __asm volatile ("LDR     R0, =0x20408000     \n"
                    "LDR     R2, =0x4028C000     \n"
                    "LDR     R2, [R2]            \n"
                    "LSLS    R2, R2, #31         \n"
                    "BPL.N   ram_init_start      \n"
                    "LDR     R0, =0x20400000     \n"
                    "ram_init_start:             \n"
                    "LDR     R1, =0x2044FFFF     \n"
                    "LDR     R2, =0              \n"
                    "LDR     R3, =0              \n"
                    "LDR     R4, =0              \n"
                    "LDR     R5, =0              \n"
                    "loop03:                     \n"
                    "STMIA   R0!, {R2 - R5}      \n"
                    "CMP     R0, R1              \n"
                    "BCC.N   loop03              \n"
                    );
#endif

#if !defined(BYPASS_ECC_ITCM1_INIT)
    __asm volatile ("LDR     R0, =0x11400000     \n"
                    "LDR     R1, =0x11407FFF     \n"
                    "LDR     R2, =0              \n"
                    "LDR     R3, =0              \n"
                    "LDR     R4, =0              \n"
                    "LDR     R5, =0              \n"
                    "loop04:                     \n"
                    "STMIA   R0!, {R2 - R5}      \n"
                    "CMP     R0, R1              \n"
                    "BCC.N   loop04              \n"
                    );
#endif

#if !defined(BYPASS_ECC_DTCM1_INIT)
    __asm volatile ("LDR     R0, =0x21400000     \n"
                    "LDR     R1, =0x2140FFFF     \n"
                    "LDR     R2, =0              \n"
                    "LDR     R3, =0              \n"
                    "LDR     R4, =0              \n"
                    "LDR     R5, =0              \n"
                    "loop05:                     \n"
                    "STMIA   R0!, {R2 - R5}      \n"
                    "CMP     R0, R1              \n"
                    "BCC.N   loop05              \n"
                    );
#endif

    // Call Reset_Handler_C
    __asm volatile ("LDR R0, =Reset_Handler_C \n"
                    "BLX R0                   \n"
                    );
}

//*****************************************************************************
// Default core exception handlers. Override the ones here by defining your own
// handler routines in your application code.
//*****************************************************************************
WEAK_AV void NMI_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void HardFault_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void MemManage_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void BusFault_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void UsageFault_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void SVC_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void DebugMon_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void PendSV_Handler(void)
{
    while(1)
    {
    }
}

WEAK_AV void SysTick_Handler(void)
{
    while(1)
    {
    }
}

//*****************************************************************************
// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.
//*****************************************************************************
WEAK_AV void DefaultISR(void)
{
    while(1)
    {
    }
}

WEAK_AV void DefaultISR1(uint32_t instance)
{
    while(1)
    {
    }
}

WEAK_AV void DefaultISR3(uint32_t instance, uint32_t start, uint32_t end)
{
    while(1)
    {
    }
}

//*****************************************************************************
// Default application exception handlers. Override the ones here by defining
// your own handler routines in your application code. These routines call
// driver exception handlers or DefaultISR() if no driver exception
// handler is included.
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void)
{
    Reserved16_DriverIRQHandler();
}

WEAK void Reserved17_IRQHandler(void)
{
    Reserved17_DriverIRQHandler();
}

WEAK void Reserved18_IRQHandler(void)
{
    Reserved18_DriverIRQHandler();
}

WEAK void Reserved19_IRQHandler(void)
{
    Reserved19_DriverIRQHandler();
}

WEAK void DMATCD0_IRQHandler(void)
{
    DMATCD0_DriverIRQHandler();
}

WEAK void DMATCD1_IRQHandler(void)
{
    DMATCD1_DriverIRQHandler();
}

WEAK void DMATCD2_IRQHandler(void)
{
    DMATCD2_DriverIRQHandler();
}

WEAK void DMATCD3_IRQHandler(void)
{
    DMATCD3_DriverIRQHandler();
}

WEAK void DMATCD4_IRQHandler(void)
{
    DMATCD4_DriverIRQHandler();
}

WEAK void DMATCD5_IRQHandler(void)
{
    DMATCD5_DriverIRQHandler();
}

WEAK void DMATCD6_IRQHandler(void)
{
    DMATCD6_DriverIRQHandler();
}

WEAK void DMATCD7_IRQHandler(void)
{
    DMATCD7_DriverIRQHandler();
}

WEAK void DMATCD8_IRQHandler(void)
{
    DMATCD8_DriverIRQHandler();
}

WEAK void DMATCD9_IRQHandler(void)
{
    DMATCD9_DriverIRQHandler();
}

WEAK void DMATCD10_IRQHandler(void)
{
    DMATCD10_DriverIRQHandler();
}

WEAK void DMATCD11_IRQHandler(void)
{
    DMATCD11_DriverIRQHandler();
}

WEAK void DMATCD12_IRQHandler(void)
{
    DMATCD12_DriverIRQHandler();
}

WEAK void DMATCD13_IRQHandler(void)
{
    DMATCD13_DriverIRQHandler();
}

WEAK void DMATCD14_IRQHandler(void)
{
    DMATCD14_DriverIRQHandler();
}

WEAK void DMATCD15_IRQHandler(void)
{
    DMATCD15_DriverIRQHandler();
}

WEAK void DMATCD16_IRQHandler(void)
{
    DMATCD16_DriverIRQHandler();
}

WEAK void DMATCD17_IRQHandler(void)
{
    DMATCD17_DriverIRQHandler();
}

WEAK void DMATCD18_IRQHandler(void)
{
    DMATCD18_DriverIRQHandler();
}

WEAK void DMATCD19_IRQHandler(void)
{
    DMATCD19_DriverIRQHandler();
}

WEAK void DMATCD20_IRQHandler(void)
{
    DMATCD20_DriverIRQHandler();
}

WEAK void DMATCD21_IRQHandler(void)
{
    DMATCD21_DriverIRQHandler();
}

WEAK void DMATCD22_IRQHandler(void)
{
    DMATCD22_DriverIRQHandler();
}

WEAK void DMATCD23_IRQHandler(void)
{
    DMATCD23_DriverIRQHandler();
}

WEAK void DMATCD24_IRQHandler(void)
{
    DMATCD24_DriverIRQHandler();
}

WEAK void DMATCD25_IRQHandler(void)
{
    DMATCD25_DriverIRQHandler();
}

